Configuration.Kanban_for_1C/src/InformationRegisters/канбан_ИсторияСтатусовЗадач/канбан_ИсторияСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>канбан_ИсторияСтатусовЗадач</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>DefinedType.канбан_СтатусыЗадачИОшибок</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>DefinedType.канбан_Пользователь</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DefinedType.канбан_ЗадачиИОшибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration.Kanban_for_1C/src/Catalogs/канбан_Ошибки/канбан_Ошибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>канбан_Ошибки</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>DefinedType.канбан_СтатусыОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>DefinedType.канбан_Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>DefinedType.канбан_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрочностьИсправления</name>
    <type>
      <types>DefinedType.канбан_СрочностьИсправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Configuration.Kanban_for_1C/src/Catalogs/канбан_Задачи/канбан_Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>канбан_Задачи</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Статус</name>
    <type>
      <types>DefinedType.канбан_СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>DefinedType.канбан_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>DefinedType.канбан_Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>DefinedType.канбан_Задачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВОтчетахИКанбанДоске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОсновнаяЗадача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрочностьИсправления</name>
    <type>
      <types>DefinedType.канбан_СрочностьИсправления</types>
    </type>
  </attributes>
</mdclass:Catalog>

Configuration.Kanban_for_1C/src/CommonModules/канбан_КанбанДоскаПереопределяемый/Module.bsl
// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

// Текст запроса данные задач.
// 
// Возвращаемое значение:
//  Строка - Текст запроса данные задач
//  
//  Запрос должен вернуть поля:
// * Задача - ОпределяемыйТип.канбан_Задачи - ссылка на задачу
// * КодЗадачи - Число, Строка - код задачи
// * СтатусЗадачи - ОпределяемыйТип.канбан_СтатусыЗадач, ОпределяемыйТип.канбан_СтатусыОшибок - если используется сопоставление статусов.
// * ХранилищеФотографии - ХранилищеЗначения - фотография исполнителя задачи.
// * ПредставлениеПользователя - Строка
// * НаименованиеЗадачи - Строка - наименование задачи
// * Проект - ОпределяемыйТип.канбан_Проекты
// * Исполнитель - ОпределяемыйТип.канбан_Пользователь
// * КодПроекта - Строка
// * НаименованиеПроекта - Строка
// * УникальныйИдентификаторПроекта - Строка
// * СрочностьИсправления - Строка - важность задачи, ошибки
// * ЭтоОшибка - Булево
//
Функция ТекстЗапросаДанныеЗадач() Экспорт
	
	ТекстОбъединенияЗапросов = канбан_КанбанДоска.ТекстОбъединитьВсе();
	ИспользоватьСопоставлениеСтатусов = Константы.канбан_ИспользоватьСопоставлениеСтатусов.Получить();
	ИмяКонфигурации = Метаданные.Имя;
	
	Если ИмяКонфигурации = "СистемаПроектированияПрикладныхРешений" Тогда
		
		#Область СистемаПроектированияПрикладныхРешений
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задачи.Ссылка КАК Задача,
			|	Задачи.Код КАК КодЗадачи,
			|	Задачи.Статус КАК СтатусЗадачи,
			|	ЕСТЬNULL(Пользователи.Фотография, """") КАК ХранилищеФотографии,
			|	ЕСТЬNULL(Пользователи.Представление, """") КАК ПредставлениеПользователя,
			|	Задачи.Наименование КАК НаименованиеЗадачи,
			|	Проекты.Ссылка КАК Проект,
			|	Задачи.Исполнитель КАК Исполнитель,
			|	Проекты.Код КАК КодПроекта,
			|	Проекты.Наименование КАК НаименованиеПроекта,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка) КАК УникальныйИдентификаторПроекта,
			|	"""" КАК СрочностьИсправления, 
			|	Ложь КАК ЭтоОшибка
			|ИЗ
			|	Справочник.ЗадачиПроцесса КАК Задачи
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО Задачи.Исполнитель = Пользователи.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехническиеПроекты КАК ТехническиеПроекты
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
			|			ПО ТехническиеПроекты.Владелец = Проекты.Ссылка
			|		ПО Задачи.Предмет = ТехническиеПроекты.Ссылка";
		
		Если ИспользоватьСопоставлениеСтатусов Тогда
			
			ТекстЗапросаОшибки =
				"ВЫБРАТЬ
				|	Ошибки.Ссылка КАК Ссылка,
				|	Ошибки.Код КАК Код,
				|	Ошибки.Статус КАК Статус,
				|	ЕСТЬNULL(Пользователи.Фотография, """") КАК Поле1,
				|	ЕСТЬNULL(Пользователи.Представление, """") КАК Поле2,
				|	Ошибки.Наименование КАК Наименование,
				|	Ошибки.Владелец КАК Владелец,
				|	Ошибки.КомуНаправлена КАК КомуНаправлена,
				|	Проекты.Код КАК Код1,
				|	Проекты.Наименование КАК Наименование1,
				|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка) КАК Поле3,
				|	Ошибки.СрочностьИсправления,
				|	Истина КАК ЭтоОшибка
				|ИЗ
				|	Справочник.Ошибки КАК Ошибки
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
				|		ПО Ошибки.КомуНаправлена = Пользователи.Ссылка
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
				|		ПО Ошибки.Владелец = Проекты.Ссылка";
			
			ТекстЗапроса = СтрШаблон("%1%2%3", ТекстЗапроса, ТекстОбъединенияЗапросов, ТекстЗапросаОшибки);
			
		КонецЕсли;
			
		#КонецОбласти
		
	ИначеЕсли ИмяКонфигурации = "УправлениеЗадачами" Тогда
		
		#Область Tasks
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задачи.Ссылка КАК Задача,
			|	Задачи.Код КАК КодЗадачи,
			|	Задачи.Статус КАК СтатусЗадачи,
			|	ЕСТЬNULL(Пользователи.Фотография, """") КАК ХранилищеФотографии,
			|	ЕСТЬNULL(Пользователи.Представление, """") КАК ПредставлениеПользователя,
			|	Задачи.Наименование КАК НаименованиеЗадачи,
			|	ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект) КАК Проект,
			|	Задачи.Исполнитель КАК Исполнитель,
			|	ЕСТЬNULL(ЗадачиОсновные.Проект.Код, Задачи.Проект.Код) КАК КодПроекта,
			|	Проекты.Наименование КАК НаименованиеПроекта,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка) КАК УникальныйИдентификаторПроекта, 
			|	Задачи.Важность КАК СрочностьИсправления,
			|	Ложь КАК ЭтоОшибка
			|ИЗ
			|	Справочник.узЗадачи КАК Задачи
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО Задачи.Исполнитель = Пользователи.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.узЗадачи КАК ЗадачиОсновные
			|		ПО Задачи.ОсновнаяЗадача = ЗадачиОсновные.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.узПроекты КАК Проекты
			|		ПО ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект) = Проекты.Ссылка
			|ГДЕ
			|	Задачи.ПоказыватьВОтчетахИКанбанДоске";
		
		Если ИспользоватьСопоставлениеСтатусов Тогда
			
			ТекстЗапросаОшибки =
				"ВЫБРАТЬ
				|	Ошибки.Ссылка КАК Ссылка,
				|	Ошибки.Код КАК Код,
				|	Ошибки.Статус КАК Статус,
				|	ЕСТЬNULL(Пользователи.Фотография, """") КАК Поле1,
				|	ЕСТЬNULL(Пользователи.Представление, """") КАК Поле2,
				|	Ошибки.Наименование КАК Наименование,
				|	Ошибки.Проект КАК Проект,
				|	Ошибки.Исполнитель КАК Исполнитель,
				|	Проекты.Код КАК Код1,
				|	Проекты.Наименование КАК Наименование1,
				|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка) КАК Поле3,
				|	Ошибки.СрочностьИсправления,
				|	Истина КАК ЭтоОшибка
				|ИЗ
				|	Справочник.канбан_Ошибки КАК Ошибки
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
				|		ПО Ошибки.Исполнитель = Пользователи.Ссылка
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.узПроекты КАК Проекты
				|		ПО Ошибки.Проект = Проекты.Ссылка";
			
			ТекстЗапроса = СтрШаблон("%1%2%3", ТекстЗапроса, ТекстОбъединенияЗапросов, ТекстЗапросаОшибки);
			
		КонецЕсли;
		
	#КонецОбласти
		
	Иначе
		
		#Область КонфигурацииНаБазеБСП
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задачи.Ссылка КАК Задача,
			|	Задачи.Код КАК КодЗадачи,
			|	Задачи.Статус КАК СтатусЗадачи,
			|	ЕСТЬNULL(Пользователи.Фотография, """") КАК ХранилищеФотографии,
			|	ЕСТЬNULL(Пользователи.Представление, """") КАК ПредставлениеПользователя,
			|	Задачи.Наименование КАК НаименованиеЗадачи,
			|	ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект) КАК Проект,
			|	Задачи.Исполнитель КАК Исполнитель,
			|	ЕСТЬNULL(ЗадачиОсновные.Проект.Код, Задачи.Проект.Код) КАК КодПроекта,
			|	Проекты.Наименование КАК НаименованиеПроекта,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка) КАК УникальныйИдентификаторПроекта,
			|	Задачи.СрочностьИсправления,
			|	Ложь КАК ЭтоОшибка
			|ИЗ
			|	Справочник.канбан_Задачи КАК Задачи
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО Задачи.Исполнитель = Пользователи.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.канбан_Задачи КАК ЗадачиОсновные
			|		ПО Задачи.ОсновнаяЗадача = ЗадачиОсновные.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.канбан_Проекты КАК Проекты
			|		ПО ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект) = Проекты.Ссылка
			|ГДЕ
			|	Задачи.ПоказыватьВОтчетахИКанбанДоске";
			
		Если ИспользоватьСопоставлениеСтатусов Тогда
			
			ТекстЗапросаОшибки =
				"ВЫБРАТЬ
				|	Ошибки.Ссылка КАК Ссылка,
				|	Ошибки.Код КАК Код,
				|	Ошибки.Статус КАК Статус,
				|	ЕСТЬNULL(Пользователи.Фотография, """") КАК Поле1,
				|	ЕСТЬNULL(Пользователи.Представление, """") КАК Поле2,
				|	Ошибки.Наименование КАК Наименование,
				|	Ошибки.Проект КАК Проект,
				|	Ошибки.Исполнитель КАК Исполнитель,
				|	Проекты.Код КАК Код1,
				|	Проекты.Наименование КАК Наименование1,
				|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка) КАК Поле3,
				|	Ошибки.СрочностьИсправления,
				|	Истина КАК ЭтоОшибка
				|ИЗ
				|	Справочник.канбан_Ошибки КАК Ошибки
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
				|		ПО Ошибки.Исполнитель = Пользователи.Ссылка
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.канбан_Проекты КАК Проекты
				|		ПО Ошибки.Проект = Проекты.Ссылка";
			
			ТекстЗапроса = СтрШаблон("%1%2%3", ТекстЗапроса, ТекстОбъединенияЗапросов, ТекстЗапросаОшибки);
			
		КонецЕсли;
		
	#КонецОбласти
	
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса статусы.
// Запрос должен вернуть заполненные поля:
// * Статус - ОпределяемыйТип.канбан_СтатусыЗадач
// * Представление - Строка - представление статуса для канбан доски
// * УникальныйИдентификатор - Строка
// 
// Возвращаемое значение:
//  Строка - Текст запроса статусы
//
Функция ТекстЗапросаСтатусы() Экспорт
	
	Запрос = Новый Запрос;
	Если Метаданные.Имя = "СистемаПроектированияПрикладныхРешений" Тогда
		
		#Область СистемаПроектированияПрикладныхРешений
		// Так как статусы в конфигурации есть перечисление, используем в качестве уникального идентификатора ПРЕДСТАВЛЕНИЕССЫЛКИ
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыЗадачи.Ссылка КАК Статус,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыЗадачи.Ссылка) КАК Представление,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыЗадачи.Ссылка) КАК УникальныйИдентификатор
			|ИЗ
			|	Перечисление.СтатусыЗадачПроцессов КАК СтатусыЗадачи";
		
		#КонецОбласти
		
	ИначеЕсли Метаданные.Имя = "УправлениеЗадачами" Тогда
		
		#Область Tasks
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыЗадачи.Ссылка КАК Статус,
			|	ВЫБОР
			|		КОГДА СтатусыЗадачи.НаименованиеДляКанбанДоски = """"
			|			ТОГДА СтатусыЗадачи.Наименование
			|		ИНАЧЕ СтатусыЗадачи.НаименованиеДляКанбанДоски
			|	КОНЕЦ КАК Представление,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СтатусыЗадачи.Ссылка) КАК УникальныйИдентификатор
			|ИЗ
			|	Справочник.узСтатусыЗадачи КАК СтатусыЗадачи";
		
		#КонецОбласти
		
	Иначе
		
		#Область КонфигурацииНаБазеБСП
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыЗадачи.Ссылка КАК Статус,
			|	ВЫБОР
			|		КОГДА СтатусыЗадачи.НаименованиеДляКанбанДоски = """"
			|			ТОГДА СтатусыЗадачи.Наименование
			|		ИНАЧЕ СтатусыЗадачи.НаименованиеДляКанбанДоски
			|	КОНЕЦ КАК Представление,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СтатусыЗадачи.Ссылка) КАК УникальныйИдентификатор
			|ИЗ
			|	Справочник.канбан_СтатусыЗадач КАК СтатусыЗадачи";
		
		#КонецОбласти
		
	КонецЕсли;
	
	Возврат Запрос.Текст;
	
КонецФункции

// Проверяет, используется ли регистр истории статусов задач в текущей конфигурации.
// Процедура предназначена для переопределения и может быть адаптирована под 
// различные конфигурации, содержащие подсистемы управления задачами.
//
// Параметры:
//  Результат - Булево
//
Процедура ИспользуетсяРегистрИсторияСтатусовЗадач(Результат) Экспорт
	
	Если Метаданные.Имя = "СистемаПроектированияПрикладныхРешений" Тогда
		Результат = Ложь;
	ИначеЕсли Метаданные.Имя = "УправлениеЗадачами" Тогда
		Результат = Ложь;
	Иначе
		// БСП: Результат остаётся Истина (установлен вызывающим кодом).
	КонецЕсли;
	
КонецПроцедуры

// Текст запроса отчёта «История задач».
// Текстовый запрос; ветка — по конфигурации. На внедрении можно переопределить целиком.
//
// Параметры СКД: &НачалоПериода, &КонецПериода, &ПустаяДата, &ТекущаяДата,
// &Проект, &Задача, &Статус, &СтатусОшибки, &Исполнитель, &ТолькоОткрытыеИнтервалы,
// &ВключатьЗадачи, &ВключатьОшибки.
//
// Запрос должен вернуть поля:
// * Задача - ОпределяемыйТип.канбан_ЗадачиИОшибки - ссылка на задачу или ошибку
// * КодЗадачи - Число, Строка - код задачи
// * НаименованиеЗадачи - Строка - наименование задачи
// * Проект - ОпределяемыйТип.канбан_Проекты
// * Статус - ОпределяемыйТип.канбан_СтатусыЗадачИОшибок - статус задачи или ошибки
// * Исполнитель - ОпределяемыйТип.канбан_Пользователь
// * ДатаНачала - Дата - начало интервала в статусе
// * ДатаОкончания - Дата - окончание интервала; пустая дата — интервал открыт
// * ДлительностьЧасов - Число - длительность интервала в часах
// * ИнтервалОткрыт - Булево - признак незакрытого интервала
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстЗапросаОтчетаИсторияЗадач() Экспорт
	
	ИмяКонфигурации = Метаданные.Имя;
	
	Если ИмяКонфигурации = "СистемаПроектированияПрикладныхРешений" Тогда
		
		#Область СистемаПроектированияПрикладныхРешений
		
		ТекстОбъединенияЗапросов = канбан_КанбанДоска.ТекстОбъединитьВсе();
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задачи.Ссылка КАК Задача,
			|	Задачи.Код КАК КодЗадачи,
			|	Задачи.Наименование КАК НаименованиеЗадачи,
			|	Проекты.Ссылка КАК Проект,
			|	Протокол.Статус КАК Статус,
			|	ЕСТЬNULL(Протокол.ИсполнительПоручения, Задачи.Исполнитель) КАК Исполнитель,
			|	Протокол.Дата КАК ДатаНачала,
			|	ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) КАК ДатаОкончания,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) = &ПустаяДата
			|			ТОГДА РАЗНОСТЬДАТ(Протокол.Дата, &ТекущаяДата, СЕКУНДА) / 3600
			|		ИНАЧЕ РАЗНОСТЬДАТ(Протокол.Дата, СледующийПротокол.Дата, СЕКУНДА) / 3600
			|	КОНЕЦ КАК ДлительностьЧасов,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) = &ПустаяДата
			|			ТОГДА Истина
			|		ИНАЧЕ Ложь
			|	КОНЕЦ КАК ИнтервалОткрыт
			|ИЗ
			|	Справочник.ЗадачиПроцесса.ПротоколВзаимодействия КАК Протокол
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса КАК Задачи
			|		ПО Протокол.Ссылка = Задачи.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехническиеПроекты КАК ТехническиеПроекты
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
			|			ПО ТехническиеПроекты.Владелец = Проекты.Ссылка
			|		ПО Задачи.Предмет = ТехническиеПроекты.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса.ПротоколВзаимодействия КАК СледующийПротокол
			|		ПО Протокол.Ссылка = СледующийПротокол.Ссылка
			|			И СледующийПротокол.НомерСтроки = Протокол.НомерСтроки + 1
			|ГДЕ
			|	Задачи.Публикуется
			|	И Протокол.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПустаяСсылка)
			|	И Протокол.Дата <= &КонецПериода
			|	И (ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) >= &НачалоПериода
			|		ИЛИ ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) = &ПустаяДата)
			|	И (НЕ &ТолькоОткрытыеИнтервалы
			|		ИЛИ ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) = &ПустаяДата)
			|	И &ВключатьЗадачи
			|{ГДЕ
			|	(Проекты.Ссылка В (&Проект)),
			|	(Задачи.Ссылка В (&Задача)),
			|	(Протокол.Статус В (&Статус)),
			|	(ЕСТЬNULL(Протокол.ИсполнительПоручения, Задачи.Исполнитель) В (&Исполнитель))}";
		
		ТекстЗапросаОшибки =
			"ВЫБРАТЬ
			|	Ошибки.Ссылка КАК Задача,
			|	Ошибки.Код КАК КодЗадачи,
			|	Ошибки.Наименование КАК НаименованиеЗадачи,
			|	Проекты.Ссылка КАК Проект,
			|	ОшибкиПротокол.Статус КАК Статус,
			|	ЕСТЬNULL(ОшибкиПротокол.КомуНаправлена, Ошибки.КомуНаправлена) КАК Исполнитель,
			|	ОшибкиПротокол.Дата КАК ДатаНачала,
			|	ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) КАК ДатаОкончания,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) = &ПустаяДата
			|			ТОГДА РАЗНОСТЬДАТ(ОшибкиПротокол.Дата, &ТекущаяДата, СЕКУНДА) / 3600
			|		ИНАЧЕ РАЗНОСТЬДАТ(ОшибкиПротокол.Дата, СледующийПротокол.Дата, СЕКУНДА) / 3600
			|	КОНЕЦ КАК ДлительностьЧасов,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) = &ПустаяДата
			|			ТОГДА Истина
			|		ИНАЧЕ Ложь
			|	КОНЕЦ КАК ИнтервалОткрыт
			|ИЗ
			|	Справочник.Ошибки.Протокол КАК ОшибкиПротокол
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ошибки КАК Ошибки
			|		ПО ОшибкиПротокол.Ссылка = Ошибки.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
			|		ПО Ошибки.Владелец = Проекты.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Ошибки.Протокол КАК СледующийПротокол
			|		ПО ОшибкиПротокол.Ссылка = СледующийПротокол.Ссылка
			|			И СледующийПротокол.НомерСтроки = ОшибкиПротокол.НомерСтроки + 1
			|ГДЕ
			|	ОшибкиПротокол.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыОшибок.ПустаяСсылка)
			|	И ОшибкиПротокол.Дата <= &КонецПериода
			|	И (ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) >= &НачалоПериода
			|		ИЛИ ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) = &ПустаяДата)
			|	И (НЕ &ТолькоОткрытыеИнтервалы
			|		ИЛИ ЕСТЬNULL(СледующийПротокол.Дата, &ПустаяДата) = &ПустаяДата)
			|	И &ВключатьОшибки
			|{ГДЕ
			|	(Проекты.Ссылка В (&Проект)),
			|	(Ошибки.Ссылка В (&Задача)),
			|	(ОшибкиПротокол.Статус В (&СтатусОшибки)),
			|	(ЕСТЬNULL(ОшибкиПротокол.КомуНаправлена, Ошибки.КомуНаправлена) В (&Исполнитель))}";
		
		ТекстЗапроса = СтрШаблон("%1%2%3", ТекстЗапроса, ТекстОбъединенияЗапросов, ТекстЗапросаОшибки);
		
		#КонецОбласти
		
	ИначеЕсли ИмяКонфигурации = "УправлениеЗадачами" Тогда
		
		#Область Tasks
		
		ТекстОбъединенияЗапросов = канбан_КанбанДоска.ТекстОбъединитьВсе();
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задачи.Ссылка КАК Задача,
			|	Задачи.Код КАК КодЗадачи,
			|	Задачи.Наименование КАК НаименованиеЗадачи,
			|	ЕСТЬNULL(Задачи.ОсновнаяЗадача.Проект, Задачи.Проект) КАК Проект,
			|	узИсторияСтатусов.Статус КАК Статус,
			|	узИсторияСтатусов.Исполнитель КАК Исполнитель,
			|	узИсторияСтатусов.ДатаНачала КАК ДатаНачала,
			|	узИсторияСтатусов.ДатаОкончания КАК ДатаОкончания,
			|	ВЫБОР
			|		КОГДА узИсторияСтатусов.ДатаОкончания = &ПустаяДата
			|			ТОГДА РАЗНОСТЬДАТ(узИсторияСтатусов.ДатаНачала, &ТекущаяДата, СЕКУНДА) / 3600
			|		ИНАЧЕ РАЗНОСТЬДАТ(узИсторияСтатусов.ДатаНачала, узИсторияСтатусов.ДатаОкончания, СЕКУНДА) / 3600
			|	КОНЕЦ КАК ДлительностьЧасов,
			|	ВЫБОР
			|		КОГДА узИсторияСтатусов.ДатаОкончания = &ПустаяДата
			|			ТОГДА Истина
			|		ИНАЧЕ Ложь
			|	КОНЕЦ КАК ИнтервалОткрыт
			|ИЗ
			|	Справочник.узЗадачи.ИсторияСтатусов КАК узИсторияСтатусов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.узЗадачи КАК Задачи
			|		ПО узИсторияСтатусов.Ссылка = Задачи.Ссылка
			|ГДЕ
			|	Задачи.ПоказыватьВОтчетахИКанбанДоске
			|	И узИсторияСтатусов.ДатаНачала <= &КонецПериода
			|	И (узИсторияСтатусов.ДатаОкончания >= &НачалоПериода
			|		ИЛИ узИсторияСтатусов.ДатаОкончания = &ПустаяДата)
			|	И (НЕ &ТолькоОткрытыеИнтервалы
			|		ИЛИ узИсторияСтатусов.ДатаОкончания = &ПустаяДата)
			|	И &ВключатьЗадачи
			|{ГДЕ
			|	(ЕСТЬNULL(Задачи.ОсновнаяЗадача.Проект, Задачи.Проект) В (&Проект)),
			|	(Задачи.Ссылка В (&Задача)),
			|	(узИсторияСтатусов.Статус В (&Статус)),
			|	(узИсторияСтатусов.Исполнитель В (&Исполнитель))}";
		
		ТекстЗапросаОшибки =
			"ВЫБРАТЬ
			|	История.Задача КАК Задача,
			|	Ошибки.Код КАК КодЗадачи,
			|	Ошибки.Наименование КАК НаименованиеЗадачи,
			|	Ошибки.Проект КАК Проект,
			|	История.Статус КАК Статус,
			|	История.Исполнитель КАК Исполнитель,
			|	История.ДатаНачала КАК ДатаНачала,
			|	История.ДатаОкончания КАК ДатаОкончания,
			|	ВЫБОР
			|		КОГДА История.ДатаОкончания = &ПустаяДата
			|			ТОГДА РАЗНОСТЬДАТ(История.ДатаНачала, &ТекущаяДата, СЕКУНДА) / 3600
			|		ИНАЧЕ РАЗНОСТЬДАТ(История.ДатаНачала, История.ДатаОкончания, СЕКУНДА) / 3600
			|	КОНЕЦ КАК ДлительностьЧасов,
			|	ВЫБОР
			|		КОГДА История.ДатаОкончания = &ПустаяДата
			|			ТОГДА Истина
			|		ИНАЧЕ Ложь
			|	КОНЕЦ КАК ИнтервалОткрыт
			|ИЗ
			|	РегистрСведений.канбан_ИсторияСтатусовЗадач КАК История
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.канбан_Ошибки КАК Ошибки
			|		ПО История.Задача = Ошибки.Ссылка
			|ГДЕ
			|	История.ДатаНачала <= &КонецПериода
			|	И (История.ДатаОкончания >= &НачалоПериода
			|		ИЛИ История.ДатаОкончания = &ПустаяДата)
			|	И (НЕ &ТолькоОткрытыеИнтервалы
			|		ИЛИ История.ДатаОкончания = &ПустаяДата)
			|	И &ВключатьОшибки
			|{ГДЕ
			|	(Ошибки.Проект В (&Проект)),
			|	(История.Задача В (&Задача)),
			|	(История.Статус В (&СтатусОшибки)),
			|	(История.Исполнитель В (&Исполнитель))}";
		
		Если канбан_КанбанДоска.ИспользуетсяВедениеОшибок() Тогда
			ТекстЗапроса = СтрШаблон("%1%2%3", ТекстЗапроса, ТекстОбъединенияЗапросов, ТекстЗапросаОшибки);
		КонецЕсли;
		
		#КонецОбласти
		
	Иначе
		
		#Область КонфигурацииНаБазеБСП
		
		ТекстОбъединенияЗапросов = канбан_КанбанДоска.ТекстОбъединитьВсе();
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	История.Задача КАК Задача,
			|	Задачи.Код КАК КодЗадачи,
			|	Задачи.Наименование КАК НаименованиеЗадачи,
			|	ЕСТЬNULL(Задачи.ОсновнаяЗадача.Проект, Задачи.Проект) КАК Проект,
			|	История.Статус КАК Статус,
			|	История.Исполнитель КАК Исполнитель,
			|	История.ДатаНачала КАК ДатаНачала,
			|	История.ДатаОкончания КАК ДатаОкончания,
			|	ВЫБОР
			|		КОГДА История.ДатаОкончания = &ПустаяДата
			|			ТОГДА РАЗНОСТЬДАТ(История.ДатаНачала, &ТекущаяДата, СЕКУНДА) / 3600
			|		ИНАЧЕ РАЗНОСТЬДАТ(История.ДатаНачала, История.ДатаОкончания, СЕКУНДА) / 3600
			|	КОНЕЦ КАК ДлительностьЧасов,
			|	ВЫБОР
			|		КОГДА История.ДатаОкончания = &ПустаяДата
			|			ТОГДА Истина
			|		ИНАЧЕ Ложь
			|	КОНЕЦ КАК ИнтервалОткрыт
			|ИЗ
			|	РегистрСведений.канбан_ИсторияСтатусовЗадач КАК История
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.канбан_Задачи КАК Задачи
			|		ПО История.Задача = Задачи.Ссылка
			|ГДЕ
			|	Задачи.ПоказыватьВОтчетахИКанбанДоске
			|	И История.ДатаНачала <= &КонецПериода
			|	И (История.ДатаОкончания >= &НачалоПериода
			|		ИЛИ История.ДатаОкончания = &ПустаяДата)
			|	И (НЕ &ТолькоОткрытыеИнтервалы
			|		ИЛИ История.ДатаОкончания = &ПустаяДата)
			|	И &ВключатьЗадачи
			|{ГДЕ
			|	(ЕСТЬNULL(Задачи.ОсновнаяЗадача.Проект, Задачи.Проект) В (&Проект)),
			|	(История.Задача В (&Задача)),
			|	(История.Статус В (&Статус)),
			|	(История.Исполнитель В (&Исполнитель))}";
		
		ТекстЗапросаОшибки =
			"ВЫБРАТЬ
			|	История.Задача КАК Задача,
			|	Ошибки.Код КАК КодЗадачи,
			|	Ошибки.Наименование КАК НаименованиеЗадачи,
			|	Ошибки.Проект КАК Проект,
			|	История.Статус КАК Статус,
			|	История.Исполнитель КАК Исполнитель,
			|	История.ДатаНачала КАК ДатаНачала,
			|	История.ДатаОкончания КАК ДатаОкончания,
			|	ВЫБОР
			|		КОГДА История.ДатаОкончания = &ПустаяДата
			|			ТОГДА РАЗНОСТЬДАТ(История.ДатаНачала, &ТекущаяДата, СЕКУНДА) / 3600
			|		ИНАЧЕ РАЗНОСТЬДАТ(История.ДатаНачала, История.ДатаОкончания, СЕКУНДА) / 3600
			|	КОНЕЦ КАК ДлительностьЧасов,
			|	ВЫБОР
			|		КОГДА История.ДатаОкончания = &ПустаяДата
			|			ТОГДА Истина
			|		ИНАЧЕ Ложь
			|	КОНЕЦ КАК ИнтервалОткрыт
			|ИЗ
			|	РегистрСведений.канбан_ИсторияСтатусовЗадач КАК История
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.канбан_Ошибки КАК Ошибки
			|		ПО История.Задача = Ошибки.Ссылка
			|ГДЕ
			|	История.ДатаНачала <= &КонецПериода
			|	И (История.ДатаОкончания >= &НачалоПериода
			|		ИЛИ История.ДатаОкончания = &ПустаяДата)
			|	И (НЕ &ТолькоОткрытыеИнтервалы
			|		ИЛИ История.ДатаОкончания = &ПустаяДата)
			|	И &ВключатьОшибки
			|{ГДЕ
			|	(Ошибки.Проект В (&Проект)),
			|	(История.Задача В (&Задача)),
			|	(История.Статус В (&СтатусОшибки)),
			|	(История.Исполнитель В (&Исполнитель))}";
		
		Если канбан_КанбанДоска.ИспользуетсяВедениеОшибок() Тогда
			ТекстЗапроса = СтрШаблон("%1%2%3", ТекстЗапроса, ТекстОбъединенияЗапросов, ТекстЗапросаОшибки);
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Изменить статус задаче.
// 
// Параметры:
//  Задача - ОпределяемыйТип.канбан_Задачи - задача ссылка.
//  Статус - ОпределяемыйТип.канбан_СтатусыЗадач - устанавливаемый статус
//  Исполнитель - ОпределяемыйТип.канбан_Пользователь
//
Процедура ИзменитьСтатусЗадаче(Знач Задача, Знач Статус, Знач Исполнитель) Экспорт
	
	#Область Tasks_КонфигурацииНаБазеБСП_СистемаПроектированияПрикладныхРешений
	
	Попытка
		
		ЗадачаОбъект = Задача.ПолучитьОбъект();
		
		ЗадачаОбъект.Заблокировать();
		
		Если ЗадачаОбъект.Статус <> Статус Тогда
			ЗадачаОбъект.Статус = Статус;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Исполнитель", ЗадачаОбъект.Метаданные()) 
			И ЗадачаОбъект.Исполнитель <> Исполнитель Тогда
			ЗадачаОбъект.Исполнитель = Исполнитель;
		КонецЕсли;
		
		Если ЗадачаОбъект.Модифицированность() Тогда
			ЗадачаОбъект.Записать();
		КонецЕсли;
		
	Исключение
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось изменить объект %1, объект может быть занят другим пользователем. 
			|Продробнее см. в журнале регистрации'"), Задача);
		ТипОперации = НСтр("ru = 'OneKanban: ИзменитьСтатусЗадаче'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Задача);
		
		ЗаписьЖурналаРегистрации(
			ТипОперации, 
			УровеньЖурналаРегистрации.Ошибка, , 
			ТекстСообщения, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	#КонецОбласти
	
КонецПроцедуры

// Статус задачи ссылка по идентификатору.
//
// Параметры:
//  ИмяОпределяемогоТипа - Строка
//  ИдентификаторСтатусаСтрока - Строка
//  СтатусСсылка - ОпределяемыйТип.канбан_СтатусыЗадач, ОпределяемыйТип.канбан_СтатусыОшибок - статус ссылка.
//
//@skip-check module-empty-method
Процедура СтатусОбъектаПоИдентификатору(Знач ИмяОпределяемогоТипа, Знач ИдентификаторСтатусаСтрока, СтатусСсылка) Экспорт
	
КонецПроцедуры

#КонецОбласти
